[{"title":"Liz & Mary – The Elite Wanted A Pedo World, They Never Expected It To Be Exposed","date":"December 17, 2022","description":"Liz Crokin is an award-winning author, an independent investigative journalist and a documentary film producer best known for her relentless work exposing sex trafficking. Mary O’Neill is the Executive Director and finance manager of America’s Future, Inc. Mary begins the conversation explaining what her organization does. Liz then breaks down how the elite want to normalize child tracking and pedophilia. The conspiracy is now the truth and the elite are panicking because the world is catching on to what they wanted. The world is fighting back because they went after the children. Hollywood, corrupt politicians, fake news all silent on the subject, tells you everything you need to know.","podcast":"https://player.blubrry.com/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Fx22report%2Fcontent.blubrry.com%2Fx22report%2Fliz_crokin_mary_flynn_oneill_final_podcast.mp3&podcast_link=https%3A%2F%2Fx22report.com%2Fliz-mary-the-elite-wanted-a-pedo-world-they-never-expected-it-to-be-exposed%2F#darkOrLight-dark&shownotes-ffffff&shownotesBackground-444444&download-ffffff&downloadBackground-444444&subscribe-ffffff&subscribeBackground-444444&share-ffffff&shareBackground-444444","meta":{"title":"Liz & Mary – The Elite Wanted A Pedo World, They Never Expected It To Be Exposed","url":"https://x22report.com/liz-mary-the-elite-wanted-a-pedo-world-they-never-expected-it-to-be-exposed/"}},{"title":"Coup De Grâce Coming, The Tide Is Turning, Political Warfare, Information Warfare – Ep. 2950","date":"December 16, 2022","description":",The players are all the same, they are pushing the Green New Deal for control and to become rich. Coal is being used more now than in the past because of the [WEF] GND push. The jobs that the Biden administration continued to push are false, the overestimated the jobs. Trump calls out Mitch McConnell and the omibus bill. The [DS] is now panicking because they lost the control of the Twitter weapon. The fake news is scrambling because they were suspended spreading a tracking link, which is against the TOS of Twitter. The [DS] lost control and now as more info comes out they are going to react. Kari Lake is now allowed to review some of the ballots. Everything is connected and in the end all the [DS] players will be exposed and the will be implicated in the pandemic, election fraud, censorship and treason.","podcast":"https://player.blubrry.com/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Fx22report%2Fcontent.blubrry.com%2Fx22report%2Fepisode_2950.mp3&podcast_link=https%3A%2F%2Fx22report.com%2Fcoup-de-grace-coming-the-tide-is-turning-political-warfare-information-warfare-ep-2950%2F#darkOrLight-dark&shownotes-ffffff&shownotesBackground-444444&download-ffffff&downloadBackground-444444&subscribe-ffffff&subscribeBackground-444444&share-ffffff&shareBackground-444444","meta":{"title":"Coup De Grâce Coming, The Tide Is Turning, Political Warfare, Information Warfare – Ep. 2950","url":"https://x22report.com/coup-de-grace-coming-the-tide-is-turning-political-warfare-information-warfare-ep-2950/"}}]